app/controllers/purchase_controller.rb

  def index
    @last_purchases = Purchase.last(10)
---
SELECT  "purchases".* FROM "purchases" ORDER BY "purchases"."id" DESC LIMIT $1  [["LIMIT", 10]]

  def remove
    Purchase.find(params[:purchase_id]).destroy
---
DELETE FROM "purchases" WHERE "purchases"."id" = $1  [["id", 26]]
SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]